{
  "_name_or_path": "ADANiD/islamic-ai-foundation",
  "architectures": ["BertForSequenceClassification"],
  "model_type": "bert",
  "hidden_size": 768,
  "num_hidden_layers": 12,
  "num_attention_heads": 12,
  "intermediate_size": 3072,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "attention_probs_dropout_prob": 0.1,
  "max_position_embeddings": 512,
  "type_vocab_size": 2,
  "initializer_range": 0.02,
  "layer_norm_eps": 1e-12,
  "pad_token_id": 0,
  "vocab_size": 30522,
  "id2label": {
    "0": "quran",
    "1": "hadith",
    "2": "fiqh",
    "3": "abjad-validation",
    "4": "general-islamic"
  },
  "label2id": {
    "quran": 0,
    "hadith": 1,
    "fiqh": 2,
    "abjad-validation": 3,
    "general-islamic": 4
  },
  "adanid_version": "1.0",
  "islamic_compliance": true,
  "supported_languages": ["ar", "ur", "en"]
  }
